<pre>
<?php
function hoge($option) {
    $s = '123１２３abcａｂｃぜんかくゼンカクﾀﾞｸｵﾝ';
//ダクオンのダはタと濁点は別にしている！
    $s2 = mb_convert_kana($s, $option, 'UTF-8');
    echo "{$option} => {$s2}\n";
}
//
hoge('r');//全角の英字を半角へ
hoge('R');//半角の英字を全角へ
hoge('n');//全角の数字を半角へ
hoge('N');//半角の数字を半角へ
hoge('a');//全角の英数字を半角へ
hoge('A');//半角の英数字を全角へ
hoge('k');//全角のカナを半角へ
hoge('K');//半角のカナを全角へ
hoge('KV');//半角のカナを全角へ（句読点一文字へ直される）
hoge('c');//全角カナをひらがなへ
hoge('C');//全角ひらがなをカナへ
hoge('h');//全角ひらがなを半角カナへ
hoge('H');//半角カナを全角ひらがなへ
hoge('HV');//半角カナを全角ひらがなへ（句読点一文字へ直される）